OdRxValueIterator.current
\details
Returns the current item.
\returns The current item.

OdRxValueIterator.next
\details
Steps to the next item.
\returns true if there was a next item, or false otherwise.

OdRxValueIterator.done
\details
Returns true if the iteration is ended.
\returns true if the iteration is ended, or false otherwise.